packages/pbi-prototype-query-translation/pbi_prototype_query_translation-1.1.6-py3-none-any.whl/pbi_prototype_query_translation/libs/FlightRecorderTraceDef.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
      <Command>
        <Batch xmlns="http://schemas.microsoft.com/analysisservices/2003/engine">
          <Create>
            <ObjectDefinition>
              <Trace>
                <ID>FlightRecorder</ID>
                <Name>FlightRecorder</Name>
                <LogFileSize>10</LogFileSize>
                <LogFileRollover>1</LogFileRollover>
                <LogFileAppend>1</LogFileAppend>
                <Events>
                  <Event>
                  <EventID>15</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>32</ColumnID>
                    <ColumnID>1</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>37</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>40</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>44</ColumnID>
                    <ColumnID>45</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>16</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>1</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>10</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>4</ColumnID>
                    <ColumnID>5</ColumnID>
                    <ColumnID>6</ColumnID>
                    <ColumnID>22</ColumnID>
                    <ColumnID>23</ColumnID>
                    <ColumnID>24</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>32</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>37</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>40</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                    <ColumnID>49</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>17</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>24</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>22</ColumnID>
                    <ColumnID>23</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>32</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>35</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>37</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                    <ColumnID>48</ColumnID>
                    <ColumnID>49</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>9</EventID>
                  <Columns>
                    <ColumnID>32</ColumnID>
                    <ColumnID>1</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>37</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>40</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>44</ColumnID>
                    <ColumnID>45</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>10</EventID>
                  <Columns>
                    <ColumnID>1</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>10</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>4</ColumnID>
                    <ColumnID>5</ColumnID>
                    <ColumnID>6</ColumnID>
                    <ColumnID>22</ColumnID>
                    <ColumnID>23</ColumnID>
                    <ColumnID>24</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>32</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>37</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>40</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                    <ColumnID>49</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>98</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>10</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>4</ColumnID>
                    <ColumnID>5</ColumnID>
                    <ColumnID>6</ColumnID>
                    <ColumnID>7</ColumnID>
                    <ColumnID>11</ColumnID>
                    <ColumnID>12</ColumnID>
                    <ColumnID>13</ColumnID>
                    <ColumnID>14</ColumnID>
                    <ColumnID>22</ColumnID>
                    <ColumnID>23</ColumnID>
                    <ColumnID>24</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                    <ColumnID>49</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>99</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>10</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>4</ColumnID>
                    <ColumnID>5</ColumnID>
                    <ColumnID>6</ColumnID>
                    <ColumnID>7</ColumnID>
                    <ColumnID>11</ColumnID>
                    <ColumnID>12</ColumnID>
                    <ColumnID>13</ColumnID>
                    <ColumnID>14</ColumnID>
                    <ColumnID>22</ColumnID>
                    <ColumnID>23</ColumnID>
                    <ColumnID>24</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>36</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                    <ColumnID>49</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>82</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>1</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>11</ColumnID>
                    <ColumnID>7</ColumnID>
                    <ColumnID>12</ColumnID>
                    <ColumnID>13</ColumnID>
                    <ColumnID>14</ColumnID>
                    <ColumnID>15</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>32</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>40</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                  <EventID>83</EventID>
                  <Columns>
                    <ColumnID>8</ColumnID>
                    <ColumnID>1</ColumnID>
                    <ColumnID>2</ColumnID>
                    <ColumnID>3</ColumnID>
                    <ColumnID>4</ColumnID>
                    <ColumnID>5</ColumnID>
                    <ColumnID>6</ColumnID>
                    <ColumnID>7</ColumnID>
                    <ColumnID>9</ColumnID>
                    <ColumnID>10</ColumnID>
                    <ColumnID>11</ColumnID>
                    <ColumnID>12</ColumnID>
                    <ColumnID>13</ColumnID>
                    <ColumnID>14</ColumnID>
                    <ColumnID>15</ColumnID>
                    <ColumnID>22</ColumnID>
                    <ColumnID>23</ColumnID>
                    <ColumnID>24</ColumnID>
                    <ColumnID>25</ColumnID>
                    <ColumnID>28</ColumnID>
                    <ColumnID>32</ColumnID>
                    <ColumnID>33</ColumnID>
                    <ColumnID>39</ColumnID>
                    <ColumnID>40</ColumnID>
                    <ColumnID>41</ColumnID>
                    <ColumnID>42</ColumnID>
                    <ColumnID>43</ColumnID>
                    <ColumnID>46</ColumnID>
                    <ColumnID>47</ColumnID>
                    <ColumnID>49</ColumnID>
                  </Columns>
                  </Event>
                  <Event>
                    <EventID>123</EventID>
                    <Columns>
                      <ColumnID>0</ColumnID>
                      <ColumnID>2</ColumnID>
                      <ColumnID>10</ColumnID>
                      <ColumnID>28</ColumnID>
                      <ColumnID>42</ColumnID>
                      <ColumnID>43</ColumnID>
                      <ColumnID>46</ColumnID>
                      <ColumnID>47</ColumnID>
                      <ColumnID>50</ColumnID>
                    </Columns>
                  </Event>
                  <Event>
                    <EventID>122</EventID>
                    <Columns>
                      <ColumnID>0</ColumnID>
                      <ColumnID>2</ColumnID>
                      <ColumnID>10</ColumnID>
                      <ColumnID>28</ColumnID>
                      <ColumnID>42</ColumnID>
                      <ColumnID>43</ColumnID>
                      <ColumnID>46</ColumnID>
                      <ColumnID>47</ColumnID>
                      <ColumnID>50</ColumnID>
                    </Columns>
                  </Event>
                  <Event>
                    <EventID>130</EventID>
                    <Columns>
                      <ColumnID>8</ColumnID>
                      <ColumnID>2</ColumnID>
                      <ColumnID>10</ColumnID>
                      <ColumnID>3</ColumnID>
                      <ColumnID>4</ColumnID>
                      <ColumnID>5</ColumnID>
                      <ColumnID>6</ColumnID>
                      <ColumnID>7</ColumnID>
                      <ColumnID>11</ColumnID>
                      <ColumnID>12</ColumnID>
                      <ColumnID>13</ColumnID>
                      <ColumnID>14</ColumnID>
                      <ColumnID>22</ColumnID>
                      <ColumnID>23</ColumnID>
                      <ColumnID>24</ColumnID>
                      <ColumnID>25</ColumnID>
                      <ColumnID>28</ColumnID>
                      <ColumnID>36</ColumnID>
                      <ColumnID>39</ColumnID>
                      <ColumnID>41</ColumnID>
                      <ColumnID>42</ColumnID>
                      <ColumnID>43</ColumnID>
                      <ColumnID>46</ColumnID>
                      <ColumnID>47</ColumnID>
                      <ColumnID>49</ColumnID>
                    </Columns>
                  </Event>
                </Events>
              </Trace>
            </ObjectDefinition>
          </Create>
        </Batch>
      </Command>
      <Properties/>
    </Execute>
  </Body>
</Envelope>
